``` Terraform will perform the following actions:

  # aws_route53_record.beacon-galaxyproject will be created
  + resource "aws_route53_record" "beacon-galaxyproject" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "beacon.galaxyproject.eu"
      + records         = [
          + "beacon.bi.privat",
        ]
      + ttl             = 600
      + type            = "CNAME"
      + zone_id         = "Z386N8B8JBC6TQ"
    }

  # aws_route53_record.maintenance-galaxyproject must be replaced
-/+ resource "aws_route53_record" "maintenance-galaxyproject" {
      ~ fqdn            = "maintenance.galaxyproject.eu" -> (known after apply)
      ~ id              = "Z386N8B8JBC6TQ_maintenance.galaxyproject.eu_A" -> (known after apply)
      ~ name            = "maintenance.galaxyproject.eu" -> "maintenance-old.galaxyproject.eu" # forces replacement
        # (5 unchanged attributes hidden)
    }

  # aws_route53_record.maintenance-new-galaxyproject will be created
  + resource "aws_route53_record" "maintenance-new-galaxyproject" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "maintenance.galaxyproject.eu"
      + records         = [
          + "10.5.67.211",
        ]
      + ttl             = 600
      + type            = "A"
      + zone_id         = "Z386N8B8JBC6TQ"
    }

  # aws_route53_record.subdomains[42] will be created
  + resource "aws_route53_record" "subdomains" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "biodiversity-genomics.usegalaxy.eu"
      + records         = [
          + "usegalaxy.eu",
        ]
      + ttl             = 7200
      + type            = "CNAME"
      + zone_id         = "Z1C7L7XFF9613J"
    }

  # aws_route53_record.training-trainee-vm-eu[0] will be created
  + resource "aws_route53_record" "training-trainee-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-10.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-trainee-vm-eu[1] will be created
  + resource "aws_route53_record" "training-trainee-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-11.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-trainee-vm-eu[2] will be created
  + resource "aws_route53_record" "training-trainee-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-12.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-trainee-vm-eu[3] will be created
  + resource "aws_route53_record" "training-trainee-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-13.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-trainee-vm-eu[4] will be created
  + resource "aws_route53_record" "training-trainee-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-14.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-trainee-vm-eu[5] will be created
  + resource "aws_route53_record" "training-trainee-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-15.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-trainee-vm-eu[6] will be created
  + resource "aws_route53_record" "training-trainee-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-16.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-trainee-vm-eu[7] will be created
  + resource "aws_route53_record" "training-trainee-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-17.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-trainee-vm-eu[8] will be created
  + resource "aws_route53_record" "training-trainee-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-18.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-trainee-vm-eu[9] will be created
  + resource "aws_route53_record" "training-trainee-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-19.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-trainee-vm-eu[10] will be created
  + resource "aws_route53_record" "training-trainee-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-20.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-trainee-vm-eu[11] will be created
  + resource "aws_route53_record" "training-trainee-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-21.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-trainee-vm-eu[12] will be created
  + resource "aws_route53_record" "training-trainee-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-22.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-trainee-vm-eu[13] will be created
  + resource "aws_route53_record" "training-trainee-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-23.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-trainee-vm-eu[14] will be created
  + resource "aws_route53_record" "training-trainee-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-24.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-trainee-vm-eu[15] will be created
  + resource "aws_route53_record" "training-trainee-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-25.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-trainee-vm-eu[16] will be created
  + resource "aws_route53_record" "training-trainee-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-26.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-trainee-vm-eu[17] will be created
  + resource "aws_route53_record" "training-trainee-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-27.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-trainee-vm-eu-gxit-wildcard[0] will be created
  + resource "aws_route53_record" "training-trainee-vm-eu-gxit-wildcard" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.ep.interactivetool.gat-10.eu.training.galaxyproject.eu"
      + records         = [
          + "gat-10.eu.training.galaxyproject.eu",
        ]
      + ttl             = 3600
      + type            = "CNAME"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-trainee-vm-eu-gxit-wildcard[1] will be created
  + resource "aws_route53_record" "training-trainee-vm-eu-gxit-wildcard" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.ep.interactivetool.gat-11.eu.training.galaxyproject.eu"
      + records         = [
          + "gat-11.eu.training.galaxyproject.eu",
        ]
      + ttl             = 3600
      + type            = "CNAME"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-trainee-vm-eu-gxit-wildcard[2] will be created
  + resource "aws_route53_record" "training-trainee-vm-eu-gxit-wildcard" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.ep.interactivetool.gat-12.eu.training.galaxyproject.eu"
      + records         = [
          + "gat-12.eu.training.galaxyproject.eu",
        ]
      + ttl             = 3600
      + type            = "CNAME"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-trainee-vm-eu-gxit-wildcard[3] will be created
  + resource "aws_route53_record" "training-trainee-vm-eu-gxit-wildcard" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.ep.interactivetool.gat-13.eu.training.galaxyproject.eu"
      + records         = [
          + "gat-13.eu.training.galaxyproject.eu",
        ]
      + ttl             = 3600
      + type            = "CNAME"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-trainee-vm-eu-gxit-wildcard[4] will be created
  + resource "aws_route53_record" "training-trainee-vm-eu-gxit-wildcard" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.ep.interactivetool.gat-14.eu.training.galaxyproject.eu"
      + records         = [
          + "gat-14.eu.training.galaxyproject.eu",
        ]
      + ttl             = 3600
      + type            = "CNAME"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-trainee-vm-eu-gxit-wildcard[5] will be created
  + resource "aws_route53_record" "training-trainee-vm-eu-gxit-wildcard" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.ep.interactivetool.gat-15.eu.training.galaxyproject.eu"
      + records         = [
          + "gat-15.eu.training.galaxyproject.eu",
        ]
      + ttl             = 3600
      + type            = "CNAME"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-trainee-vm-eu-gxit-wildcard[6] will be created
  + resource "aws_route53_record" "training-trainee-vm-eu-gxit-wildcard" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.ep.interactivetool.gat-16.eu.training.galaxyproject.eu"
      + records         = [
          + "gat-16.eu.training.galaxyproject.eu",
        ]
      + ttl             = 3600
      + type            = "CNAME"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-trainee-vm-eu-gxit-wildcard[7] will be created
  + resource "aws_route53_record" "training-trainee-vm-eu-gxit-wildcard" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.ep.interactivetool.gat-17.eu.training.galaxyproject.eu"
      + records         = [
          + "gat-17.eu.training.galaxyproject.eu",
        ]
      + ttl             = 3600
      + type            = "CNAME"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-trainee-vm-eu-gxit-wildcard[8] will be created
  + resource "aws_route53_record" "training-trainee-vm-eu-gxit-wildcard" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.ep.interactivetool.gat-18.eu.training.galaxyproject.eu"
      + records         = [
          + "gat-18.eu.training.galaxyproject.eu",
        ]
      + ttl             = 3600
      + type            = "CNAME"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-trainee-vm-eu-gxit-wildcard[9] will be created
  + resource "aws_route53_record" "training-trainee-vm-eu-gxit-wildcard" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.ep.interactivetool.gat-19.eu.training.galaxyproject.eu"
      + records         = [
          + "gat-19.eu.training.galaxyproject.eu",
        ]
      + ttl             = 3600
      + type            = "CNAME"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-trainee-vm-eu-gxit-wildcard[10] will be created
  + resource "aws_route53_record" "training-trainee-vm-eu-gxit-wildcard" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.ep.interactivetool.gat-20.eu.training.galaxyproject.eu"
      + records         = [
          + "gat-20.eu.training.galaxyproject.eu",
        ]
      + ttl             = 3600
      + type            = "CNAME"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-trainee-vm-eu-gxit-wildcard[11] will be created
  + resource "aws_route53_record" "training-trainee-vm-eu-gxit-wildcard" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.ep.interactivetool.gat-21.eu.training.galaxyproject.eu"
      + records         = [
          + "gat-21.eu.training.galaxyproject.eu",
        ]
      + ttl             = 3600
      + type            = "CNAME"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-trainee-vm-eu-gxit-wildcard[12] will be created
  + resource "aws_route53_record" "training-trainee-vm-eu-gxit-wildcard" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.ep.interactivetool.gat-22.eu.training.galaxyproject.eu"
      + records         = [
          + "gat-22.eu.training.galaxyproject.eu",
        ]
      + ttl             = 3600
      + type            = "CNAME"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-trainee-vm-eu-gxit-wildcard[13] will be created
  + resource "aws_route53_record" "training-trainee-vm-eu-gxit-wildcard" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.ep.interactivetool.gat-23.eu.training.galaxyproject.eu"
      + records         = [
          + "gat-23.eu.training.galaxyproject.eu",
        ]
      + ttl             = 3600
      + type            = "CNAME"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-trainee-vm-eu-gxit-wildcard[14] will be created
  + resource "aws_route53_record" "training-trainee-vm-eu-gxit-wildcard" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.ep.interactivetool.gat-24.eu.training.galaxyproject.eu"
      + records         = [
          + "gat-24.eu.training.galaxyproject.eu",
        ]
      + ttl             = 3600
      + type            = "CNAME"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-trainee-vm-eu-gxit-wildcard[15] will be created
  + resource "aws_route53_record" "training-trainee-vm-eu-gxit-wildcard" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.ep.interactivetool.gat-25.eu.training.galaxyproject.eu"
      + records         = [
          + "gat-25.eu.training.galaxyproject.eu",
        ]
      + ttl             = 3600
      + type            = "CNAME"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-trainee-vm-eu-gxit-wildcard[16] will be created
  + resource "aws_route53_record" "training-trainee-vm-eu-gxit-wildcard" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.ep.interactivetool.gat-26.eu.training.galaxyproject.eu"
      + records         = [
          + "gat-26.eu.training.galaxyproject.eu",
        ]
      + ttl             = 3600
      + type            = "CNAME"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-trainee-vm-eu-gxit-wildcard[17] will be created
  + resource "aws_route53_record" "training-trainee-vm-eu-gxit-wildcard" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.ep.interactivetool.gat-27.eu.training.galaxyproject.eu"
      + records         = [
          + "gat-27.eu.training.galaxyproject.eu",
        ]
      + ttl             = 3600
      + type            = "CNAME"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu[0] will be created
  + resource "aws_route53_record" "training-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-0.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu[1] will be created
  + resource "aws_route53_record" "training-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-1.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu[2] will be created
  + resource "aws_route53_record" "training-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-2.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu[3] will be created
  + resource "aws_route53_record" "training-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-3.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu[4] will be created
  + resource "aws_route53_record" "training-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-4.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu[5] will be created
  + resource "aws_route53_record" "training-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-5.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu[6] will be created
  + resource "aws_route53_record" "training-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-6.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu[7] will be created
  + resource "aws_route53_record" "training-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-7.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu[8] will be created
  + resource "aws_route53_record" "training-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-8.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu[9] will be created
  + resource "aws_route53_record" "training-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-9.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu-gxit-wildcard[0] will be created
  + resource "aws_route53_record" "training-vm-eu-gxit-wildcard" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.ep.interactivetool.gat-0.eu.training.galaxyproject.eu"
      + records         = [
          + "gat-0.eu.training.galaxyproject.eu",
        ]
      + ttl             = 3600
      + type            = "CNAME"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu-gxit-wildcard[1] will be created
  + resource "aws_route53_record" "training-vm-eu-gxit-wildcard" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.ep.interactivetool.gat-1.eu.training.galaxyproject.eu"
      + records         = [
          + "gat-1.eu.training.galaxyproject.eu",
        ]
      + ttl             = 3600
      + type            = "CNAME"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu-gxit-wildcard[2] will be created
  + resource "aws_route53_record" "training-vm-eu-gxit-wildcard" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.ep.interactivetool.gat-2.eu.training.galaxyproject.eu"
      + records         = [
          + "gat-2.eu.training.galaxyproject.eu",
        ]
      + ttl             = 3600
      + type            = "CNAME"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu-gxit-wildcard[3] will be created
  + resource "aws_route53_record" "training-vm-eu-gxit-wildcard" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.ep.interactivetool.gat-3.eu.training.galaxyproject.eu"
      + records         = [
          + "gat-3.eu.training.galaxyproject.eu",
        ]
      + ttl             = 3600
      + type            = "CNAME"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu-gxit-wildcard[4] will be created
  + resource "aws_route53_record" "training-vm-eu-gxit-wildcard" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.ep.interactivetool.gat-4.eu.training.galaxyproject.eu"
      + records         = [
          + "gat-4.eu.training.galaxyproject.eu",
        ]
      + ttl             = 3600
      + type            = "CNAME"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu-gxit-wildcard[5] will be created
  + resource "aws_route53_record" "training-vm-eu-gxit-wildcard" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.ep.interactivetool.gat-5.eu.training.galaxyproject.eu"
      + records         = [
          + "gat-5.eu.training.galaxyproject.eu",
        ]
      + ttl             = 3600
      + type            = "CNAME"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu-gxit-wildcard[6] will be created
  + resource "aws_route53_record" "training-vm-eu-gxit-wildcard" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.ep.interactivetool.gat-6.eu.training.galaxyproject.eu"
      + records         = [
          + "gat-6.eu.training.galaxyproject.eu",
        ]
      + ttl             = 3600
      + type            = "CNAME"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu-gxit-wildcard[7] will be created
  + resource "aws_route53_record" "training-vm-eu-gxit-wildcard" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.ep.interactivetool.gat-7.eu.training.galaxyproject.eu"
      + records         = [
          + "gat-7.eu.training.galaxyproject.eu",
        ]
      + ttl             = 3600
      + type            = "CNAME"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu-gxit-wildcard[8] will be created
  + resource "aws_route53_record" "training-vm-eu-gxit-wildcard" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.ep.interactivetool.gat-8.eu.training.galaxyproject.eu"
      + records         = [
          + "gat-8.eu.training.galaxyproject.eu",
        ]
      + ttl             = 3600
      + type            = "CNAME"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu-gxit-wildcard[9] will be created
  + resource "aws_route53_record" "training-vm-eu-gxit-wildcard" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.ep.interactivetool.gat-9.eu.training.galaxyproject.eu"
      + records         = [
          + "gat-9.eu.training.galaxyproject.eu",
        ]
      + ttl             = 3600
      + type            = "CNAME"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.upload-galaxyproject will be updated in-place
  ~ resource "aws_route53_record" "upload-galaxyproject" {
        id              = "Z386N8B8JBC6TQ_upload.galaxyproject.eu_A"
        name            = "upload.galaxyproject.eu"
      ~ records         = [
          - "10.4.68.194",
        ] -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_route53_record.usegalaxy_eu_forwardmail_validation_txt will be updated in-place
  ~ resource "aws_route53_record" "usegalaxy_eu_forwardmail_validation_txt" {
        id              = "Z1C7L7XFF9613J__TXT"
      ~ ttl             = 10 -> 3600
        # (5 unchanged attributes hidden)
    }

  # openstack_compute_instance_v2.maintenance-new will be created
  + resource "openstack_compute_instance_v2" "maintenance-new" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.xlarge"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "cloud2"
      + name                = "maintenance.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "htcondor_shared_port",
          + "rsyslog",
        ]
      + stop_before_destroy = false
      + user_data           = "f1afc818d33a9c6c68d6c2dd4401f2e9abd7f8fc"

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "6dd3a725-d5c2-4b34-9170-ad58a7dfabfa"
          + volume_size           = 500
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "bioinf"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-trainee-vm-eu[0] will be created
  + resource "openstack_compute_instance_v2" "training-trainee-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.xlarge"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-10.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = "6a164de1a8943b8be731dd8f832614207c67b512"

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "f2309846-2c2c-4b0f-aa95-8af7cd67d067"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-trainee-vm-eu[1] will be created
  + resource "openstack_compute_instance_v2" "training-trainee-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.xlarge"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-11.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = "b1ffc368f85f5d91934b4613839a0cf38255858c"

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "f2309846-2c2c-4b0f-aa95-8af7cd67d067"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-trainee-vm-eu[2] will be created
  + resource "openstack_compute_instance_v2" "training-trainee-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.xlarge"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-12.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = "8f1242c8721ac89d7291c70dddec45f50ea52668"

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "f2309846-2c2c-4b0f-aa95-8af7cd67d067"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-trainee-vm-eu[3] will be created
  + resource "openstack_compute_instance_v2" "training-trainee-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.xlarge"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-13.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = "ba6a2c6d0410a27c744191427385ca75718f4726"

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "f2309846-2c2c-4b0f-aa95-8af7cd67d067"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-trainee-vm-eu[4] will be created
  + resource "openstack_compute_instance_v2" "training-trainee-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.xlarge"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-14.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = "ef85bd38b12b5fdaf83dbdb86cdd75174251848a"

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "f2309846-2c2c-4b0f-aa95-8af7cd67d067"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-trainee-vm-eu[5] will be created
  + resource "openstack_compute_instance_v2" "training-trainee-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.xlarge"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-15.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = "9ef3e1c3bf4e4168c501972048c5bbf33feece2b"

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "f2309846-2c2c-4b0f-aa95-8af7cd67d067"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-trainee-vm-eu[6] will be created
  + resource "openstack_compute_instance_v2" "training-trainee-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.xlarge"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-16.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = "ce545923fa419b548d31d3de2dabd0be0c7b1e4a"

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "f2309846-2c2c-4b0f-aa95-8af7cd67d067"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-trainee-vm-eu[7] will be created
  + resource "openstack_compute_instance_v2" "training-trainee-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.xlarge"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-17.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = "72bc663a1e5db5d4c0ee446b566a56788368c267"

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "f2309846-2c2c-4b0f-aa95-8af7cd67d067"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-trainee-vm-eu[8] will be created
  + resource "openstack_compute_instance_v2" "training-trainee-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.xlarge"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-18.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = "2cd1bf83fd795203068e9cf45657ad9edfc7293e"

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "f2309846-2c2c-4b0f-aa95-8af7cd67d067"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-trainee-vm-eu[9] will be created
  + resource "openstack_compute_instance_v2" "training-trainee-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.xlarge"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-19.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = "d5c4fe8d489d10a1e1a636aad592a9ef381ea2b8"

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "f2309846-2c2c-4b0f-aa95-8af7cd67d067"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-trainee-vm-eu[10] will be created
  + resource "openstack_compute_instance_v2" "training-trainee-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.xlarge"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-20.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = "460900d8469eb0dbd38bd843615984968d04066f"

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "f2309846-2c2c-4b0f-aa95-8af7cd67d067"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-trainee-vm-eu[11] will be created
  + resource "openstack_compute_instance_v2" "training-trainee-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.xlarge"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-21.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = "61d111cebadc46a12d35b4092bb51694f317157a"

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "f2309846-2c2c-4b0f-aa95-8af7cd67d067"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-trainee-vm-eu[12] will be created
  + resource "openstack_compute_instance_v2" "training-trainee-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.xlarge"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-22.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = "d6b5a2ad0d7cfda97e1ca79d5ad0b9aa666a126e"

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "f2309846-2c2c-4b0f-aa95-8af7cd67d067"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-trainee-vm-eu[13] will be created
  + resource "openstack_compute_instance_v2" "training-trainee-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.xlarge"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-23.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = "0610ffa1868e6f627c56da0bf8edc8fe54fc69b3"

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "f2309846-2c2c-4b0f-aa95-8af7cd67d067"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-trainee-vm-eu[14] will be created
  + resource "openstack_compute_instance_v2" "training-trainee-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.xlarge"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-24.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = "e3c60f3c52c1f5c7fc58ea05407d2d098206a113"

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "f2309846-2c2c-4b0f-aa95-8af7cd67d067"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-trainee-vm-eu[15] will be created
  + resource "openstack_compute_instance_v2" "training-trainee-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.xlarge"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-25.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = "d360bc3bc51d1535372532503fa1e237d6ba2b36"

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "f2309846-2c2c-4b0f-aa95-8af7cd67d067"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-trainee-vm-eu[16] will be created
  + resource "openstack_compute_instance_v2" "training-trainee-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.xlarge"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-26.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = "fd78b74c324fd80432a16597c1ade4ac3adddfbb"

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "f2309846-2c2c-4b0f-aa95-8af7cd67d067"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-trainee-vm-eu[17] will be created
  + resource "openstack_compute_instance_v2" "training-trainee-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.xlarge"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-27.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = "f4dc15ca2611a408222fb685262588dd7261ca09"

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "f2309846-2c2c-4b0f-aa95-8af7cd67d067"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[0] will be created
  + resource "openstack_compute_instance_v2" "training-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.xlarge"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-0.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = "be0dd724f242882579a44f8230827c2e779df69e"

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "f2309846-2c2c-4b0f-aa95-8af7cd67d067"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[1] will be created
  + resource "openstack_compute_instance_v2" "training-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.xlarge"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-1.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = "be381fe8187ba0caf30a1d0ccb3a0eb64e286833"

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "f2309846-2c2c-4b0f-aa95-8af7cd67d067"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[2] will be created
  + resource "openstack_compute_instance_v2" "training-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.xlarge"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-2.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = "2f3d45d4a9a0abd28b6dce33c40d321b3cd1780a"

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "f2309846-2c2c-4b0f-aa95-8af7cd67d067"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[3] will be created
  + resource "openstack_compute_instance_v2" "training-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.xlarge"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-3.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = "cdad14f42a41de490dca30db8da7d9cd53615435"

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "f2309846-2c2c-4b0f-aa95-8af7cd67d067"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[4] will be created
  + resource "openstack_compute_instance_v2" "training-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.xlarge"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-4.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = "c8642edb516eb61a1e601188211e4bbcba30fb01"

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "f2309846-2c2c-4b0f-aa95-8af7cd67d067"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[5] will be created
  + resource "openstack_compute_instance_v2" "training-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.xlarge"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-5.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = "7c2467473621f8d0fac6361242faa04252fef087"

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "f2309846-2c2c-4b0f-aa95-8af7cd67d067"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[6] will be created
  + resource "openstack_compute_instance_v2" "training-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.xlarge"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-6.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = "336135678ca0190ee7400fe1331581043d9748e3"

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "f2309846-2c2c-4b0f-aa95-8af7cd67d067"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[7] will be created
  + resource "openstack_compute_instance_v2" "training-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.xlarge"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-7.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = "896bd903cc5296aa249f23d79e6ae0441979bdb5"

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "f2309846-2c2c-4b0f-aa95-8af7cd67d067"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[8] will be created
  + resource "openstack_compute_instance_v2" "training-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.xlarge"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-8.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = "d48066902831793dc9dd330befdb89590e629e96"

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "f2309846-2c2c-4b0f-aa95-8af7cd67d067"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[9] will be created
  + resource "openstack_compute_instance_v2" "training-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.xlarge"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-9.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = "f7063070eb34c1ed2088205746e16540df463b04"

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "f2309846-2c2c-4b0f-aa95-8af7cd67d067"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.upload will be created
  + resource "openstack_compute_instance_v2" "upload" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.medium"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = "5a31b410-4f09-4b6c-84eb-eb16ca237f0a"
      + image_name          = (known after apply)
      + key_pair            = "cloud2"
      + name                = "upload.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "public-ssh",
          + "public-web2",
          + "ufr-ingress",
        ]
      + stop_before_destroy = false
      + user_data           = "f1afc818d33a9c6c68d6c2dd4401f2e9abd7f8fc"

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "bioinf"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

Plan: 90 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  ~ training_ips-eu          = [
      - [
          - "192.52.32.152",
          - "192.52.35.160",
          - "192.52.32.234",
          - "192.52.35.137",
          - "192.52.35.133",
          - "192.52.34.69",
          - "192.52.36.91",
          - "192.52.36.71",
          - "192.52.32.164",
          - "192.52.34.161",
        ],
      + [
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
        ],
    ]
  ~ training_ips-trainee-eu  = [
      - [
          - "192.52.33.54",
          - "192.52.32.194",
          - "192.52.33.8",
          - "192.52.33.165",
          - "192.52.36.252",
          - "192.52.36.15",
          - "192.52.34.105",
          - "192.52.32.23",
          - "192.52.34.90",
          - "192.52.32.57",
          - "192.52.32.193",
          - "192.52.33.167",
          - "192.52.34.2",
          - "192.52.35.235",
          - "192.52.34.98",
          - "192.52.37.20",
          - "192.52.34.158",
          - "192.52.36.228",
        ],
      + [
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
        ],
    ]
  ~ upload-node_public-ip-v4 = "10.5.67.127" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan" ```